In [16]:
import requests

url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
response = requests.get(url)

# Save the content to a file
with open("titanic.csv", "wb") as file:
    file.write(response.content)

# Load the CSV into a DataFrame
import pandas as pd
data = pd.read_csv("titanic.csv")

 The Titanic Passenger dataset provides information about passengers who were aboard the RMS Titanic during its ill-fated maiden voyage. This dataset is often used for exploring patterns and factors associated with survival on the Titanic.

 The dataset includes the following columns:

PassengerId: Unique identifier for each passenger.

Survived: Survival status of the passenger (0 = Not Survived, 1 = Survived).

Pclass: Passenger class (1 = First class, 2 = Second class, 3 = Third class).

Sex: Gender of the passenger.

Age: Age of the passenger.

SibSp: Number of siblings/spouses aboard the Titanic.

Parch: Number of parents/children aboard the Titanic.

Fare: Fare paid by the passenger.

Embarked: Port of embarkation (C = Cherbourg, Q = Queenstown, S = Southampton).

Ticket: Indicates the ticket identifier.

Cabin: Indicates the cabin number or is NaN if no cabin was assigned.

In [18]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# **Lab**: **Titanic Data Transformation in Python with Pandas**

**Part 1**: **Applying Functions to Data**

# Objective:
**Apply various functions to transform and manipulate data in the Titanic dataset.**

# Tasks:

**Applying Functions using apply:**

**Create a new column 'Fare_Double' where each fare is doubled using the apply method.**

**Mapping Passenger Classes using map**

**Create a new column 'Class_Category' by mapping the 'Pclass' values to categories (e.g., 'First', 'Second', 'Third') using a dictionary and the map method.**

**Applying Functions to the Entire DataFrame using applymap:**

**Create a new DataFrame 'titanic_transformed' where all numerical values are squared using the applymap method.**

#1-**Create a new column 'Fare_Double' where each fare is doubled using the apply method.**

#3- **Create a new column 'Class_Category' by mapping the 'Pclass' values to categories (e.g., 'First', 'Second', 'Third') using a dictionary and the map method.**

#3- **Create a new DataFrame 'titanic_transformed' where all numerical values are squared using the applymap method.**

# **Tasks:**

**Combine DataFrames using merge:**

**Merge the titanic_df and cabins_df DataFrames based on the 'PassengerId' column**.

Name the resulting DataFrame 'titanic_cabins'.

Join DataFrames with Different Keys:

Create a new DataFrame 'titanic_full' by joining the 'titanic_cabins' DataFrame with the original titanic_df DataFrame using different keys.

In [ ]:
# Additional dataset
cabins_data = {
    'PassengerId': [1, 2, 3, 4, 5],
    'Cabin': ['C123', 'E456', 'C123', 'G789', 'D101']
}

cabins_df = pd.DataFrame(cabins_data)

# **Combine DataFrames using merge:**

**Merge the titanic_df and cabins_df DataFrames based on the 'PassengerId' column. Name the resulting DataFrame 'titanic_cabins'.**

## **Join DataFrames with Different Keys:**

**Create a new DataFrame 'titanic_full' by joining the 'titanic_cabins' DataFrame with the original titanic_df DataFrame using different keys.**